#pragma once

/// <summary>
/// ゲームルールクラス
/// </summary>
class GameRule {

	/// ================================================== ///
	/// メンバ関数
	/// ================================================== ///
public:
	
	/// <summary>
	/// 初期化
	/// </summary>
	void Initialize();

	/// <summary>
	/// 更新
	/// </summary>
	void Update();

	/// ================================================== ///
	/// ゲッター
	/// ================================================== ///
public:

	/// <summary>
	/// クリア判定
	/// </summary>
	/// <returns></returns>
	bool IsClear() const { return isClear_; }

	/// <summary>
	/// ゲームオーバー判定
	/// </summary>
	/// <returns></returns>
	bool IsGameOver() const { return isGameOver_; }

	/// ================================================== ///
	/// セッター
	/// ================================================== ///
public:



	/// ================================================== ///
	/// メンバ変数
	/// ================================================== ///
private:

	// クリアフラグ
	bool isClear_ = false;

	// ゲームオーバーフラグ
	bool isGameOver_ = false;
};

